package com.javastudy;

public class JavaStudy005 {

    public static void main(String[] args) {
        /* Class */
        /* 객체지향1
        * 코드의 재사용성
        * 코드의 관리
        * 신뢰성 높은 프로그램 개발(제어자, 메서드 사용하여 데이터를 보호하고, 코드의 중복을 제거하여 코드의 불일치로 인한 오류 방지)
        * 클래스란 - 객체를 정의해 놓은 것.
        * 용도 - 객체를 생성하는데 사용됨.
        * 정의 - 실제로 존재하는 것. 사물 또는 개념.
        * 객체의 용도 - 객체의 속성과 기능에 따라 다름.
        * 
        * 객체와 인스턴스
        * 객체는 인스턴스를 포함하는 일반적인 의미
        * 인스턴스화
        * 클래스로부터 인스턴스를 생성하는 것
        * 
        * 객체의 구성요소 - 속성과 기능.
        * 
        * 인스턴스의 생성과 사용
        * 클래스명 참조변수명; // 객체를 다루기 위한 참조변수 선언
        * 참조변수명 = new 클래스명(); // 객체를 생성 후, 생성된 객체의 주소를 참조변수에 저장
        * 
        * 클래스의 또 다른 정의
        * 1. 클래스 - 데이터와 함수의 결합
        * 변수 - 하나의 데이터를 저장할 수 있는 공간
        * 배열 - 같은 타입의 여러 데이터를 저장할 수 있는 공간
        * 구조체 - 타입에 관계없이 서로 관련된 데이터들을 저장할 수 있는 공간
        * 클래스 - 데이터와 함수의 결합 (구조체 + 함수)
        **/
        
        /* 객체지향2
        *
        * 
        * 
        * **/
        
        
    }

}