package com.javastudy;

public class JavaStudy001 {
    // chapter 3 - 변수 (chapter 1, 2 skip)
    //==================================================================================================
    // 변수의 타입
    // 문자 char
    // 숫자
    // -정수 : byte, short, int, long
    // -실수 : float, double
    // 논리 boolean
    //==================================================================================================
    // 기본형 - 실제 값을 저장
    // 8개 - boolean, char, byte, short, int, long
    // 참조형 - 객체의 주소 값을 저장
    // 기본형을 제외한 나머지 String, System 등
    //==================================================================================================
    // 변수의 기본값과 초기화
    // boolean false
    // char '\u0000'
    // byte 0
    // short 0
    // int 0
    // long 0L
    // float 0.0f
    // double 0.0d or 0.0
    // 참조형 변수 null
    //==================================================================================================
    public static void main(String[] args) {
        System.out.println("day01 - 2021-03-02");
    }
}
